app/controllers/dashboard_controller.rb

SELECT "clients".* FROM "clients" WHERE "clients"."id" IN (4, 6, 5)
SELECT "invoices".* FROM "invoices" ORDER BY "invoices"."created_at" DESC LIMIT 5
---
  def index
    # Calculate metrics from real data
    metrics = calculate_metrics

    # Get recent invoices
    recent_invoices = Invoice.includes(:client)
                             .recent
                             .limit(5)
                             .map { |invoice| serialize_invoice(invoice) }

SELECT SUM("invoices"."total") FROM "invoices" WHERE "invoices"."status" = 'paid' AND "invoices"."updated_at" BETWEEN '2024-12-31 16:00:00' AND '2025-12-31 15:59:59.999999'
SELECT COUNT(*) FROM "invoices" WHERE "invoices"."status" = 'pending' AND (due_date < '2025-12-15')
---
  def calculate_metrics
    # Outstanding = pending + overdue totals
    outstanding = Invoice.outstanding.sum(:total)

    # Paid this month
    paid_this_month = Invoice.paid
                             .where(updated_at: Time.current.beginning_of_month..Time.current.end_of_month)
                             .sum(:total)

    # Paid year to date
    paid_ytd = Invoice.paid
                      .where(updated_at: Time.current.beginning_of_year..Time.current.end_of_year)
                      .sum(:total)

    # Overdue stats
    overdue_invoices = Invoice.where(status: 'pending').where('due_date < ?', Date.today)

    {
      totalOutstanding: outstanding.to_f,
      totalPaidThisMonth: paid_this_month.to_f,
      totalPaidYTD: paid_ytd.to_f,
      overdueAmount: overdue_invoices.sum(:total).to_f,
      overdueCount: overdue_invoices.count

SELECT "clients".* FROM "clients" WHERE "clients"."id" IN (4, 6, 5)
SELECT "invoices".* FROM "invoices" ORDER BY "invoices"."updated_at" DESC LIMIT 10
SELECT "clients".* FROM "clients" ORDER BY "clients"."created_at" DESC LIMIT 5
---
  def build_recent_activity
    activities = []

    # Get recent invoices and clients for activity feed
    recent_invoices = Invoice.includes(:client).order(updated_at: :desc).limit(10)
    recent_clients = Client.order(created_at: :desc).limit(5)

    recent_invoices.each do |invoice|
      activities << {
        id: "inv_#{invoice.id}",
        type: activity_type_for_invoice(invoice),
        description: activity_description_for_invoice(invoice),
        timestamp: invoice.updated_at.iso8601,
        relatedId: invoice.id.to_s,
        relatedType: 'invoice'
      }
    end

    recent_clients.each do |client|