app/controllers/invoices_controller.rb

  def index
    @invoices = Invoice.includes(:client, :line_items)
                       .order(created_at: :desc)

    # Apply status filter if provided
    if params[:status].present? && params[:status] != 'all'
      @invoices = @invoices.where(status: params[:status])
    end

    render inertia: 'Invoices/Index', props: {
      invoices: @invoices.map { |invoice| serialize_invoice(invoice) },
      filters: {
---
SELECT "clients".* FROM "clients" WHERE "clients"."id" IN (4, 6, 5)
SELECT "invoices".* FROM "invoices" ORDER BY "invoices"."created_at" DESC
SELECT "line_items".* FROM "line_items" WHERE "line_items"."invoice_id" IN (8, 7, 6, 5)

  def new
    @clients = Client.order(:name)

    render inertia: 'Invoices/New', props: {
      clients: @clients.map { |client| serialize_client(client) },
      invoiceNumber: generate_invoice_number
---
SELECT "clients".* FROM "clients" ORDER BY "clients"."name" ASC

  def edit
    @clients = Client.order(:name)

    render inertia: 'Invoices/Edit', props: {
      invoice: serialize_invoice(@invoice, include_line_items: true),
      clients: @clients.map { |client| serialize_client(client) }
---
SELECT "clients".* FROM "clients" ORDER BY "clients"."name" ASC

  def update
    if @invoice.update(invoice_params)
---
UPDATE "invoices" SET "notes" = 'waiting for response', "updated_at" = '2025-12-15 08:46:50.673817' WHERE "invoices"."id" = 8

  def set_invoice
    @invoice = Invoice.includes(:client, :line_items).find(params[:id])
---
SELECT "clients".* FROM "clients" WHERE "clients"."id" = 4
SELECT "invoices".* FROM "invoices" WHERE "invoices"."id" = 8 LIMIT 1
SELECT "line_items".* FROM "line_items" WHERE "line_items"."invoice_id" = 8

  def serialize_invoice(invoice, include_line_items: false)
    data = {
      id: invoice.id.to_s,
      invoiceNumber: invoice.invoice_number,
      clientId: invoice.client_id.to_s,
      client: invoice.client ? {
        id: invoice.client.id.to_s,
        name: invoice.client.name,
        email: invoice.client.email,
        company: invoice.client.company,
        address: invoice.client.address,
        phone: invoice.client.phone
      } : nil,
      clientName: invoice.client&.name || 'Unknown Client',
      clientCompany: invoice.client&.company,
      clientEmail: invoice.client&.email,
      issueDate: invoice.issue_date.iso8601,
      dueDate: invoice.due_date.iso8601,
      status: invoice.status,
      subtotal: invoice.subtotal.to_f,
      totalDiscount: invoice.total_discount.to_f,
      total: invoice.total.to_f,
      notes: invoice.notes,
      token: invoice.token,
      createdAt: invoice.created_at.iso8601,
      updatedAt: invoice.updated_at.iso8601
    }

    if include_line_items
      data[:lineItems] = invoice.line_items.order(:position).map do |item|
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."invoice_id" = 5 ORDER BY "line_items"."position" ASC

  def generate_invoice_number
    year = Date.today.year
    # Get the last invoice number for this year
    last_invoice = Invoice.where("invoice_number LIKE ?", "INV-#{year}-%")
                          .order(invoice_number: :desc)
                          .first
---
SELECT "invoices".* FROM "invoices" WHERE (invoice_number LIKE 'INV-2025-%') ORDER BY "invoices"."invoice_number" DESC LIMIT 1

  def update_line_items(invoice, line_items_params)
    return unless line_items_params.present?

    # Get existing item IDs
    existing_ids = invoice.line_items.pluck(:id).map(&:to_s)
    submitted_ids = line_items_params.map { |p| p[:id] }.compact

    # Delete removed items
    ids_to_delete = existing_ids - submitted_ids
    invoice.line_items.where(id: ids_to_delete).destroy_all if ids_to_delete.any?
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."invoice_id" = 8 AND "line_items"."id" = 18 LIMIT 1