app/controllers/payments_controller.rb

SELECT "invoices".* FROM "invoices" WHERE "invoices"."token" = 'Ehx6D1YYqIITBQo9i0NRUw' LIMIT 1
---
  def create_checkout
    @invoice = Invoice.find_by!(token: params[:token])

SELECT "invoices".* FROM "invoices" WHERE "invoices"."token" = 'Ehx6D1YYqIITBQo9i0NRUw' LIMIT 1
---
  def success
    @invoice = Invoice.find_by!(token: params[:token])