app/controllers/public_invoices_controller.rb

SELECT "invoices".* FROM "invoices" WHERE "invoices"."token" = ':token' LIMIT 1
---
  def show
    @invoice = Invoice.includes(:client, :line_items).find_by!(token: params[:token])