app/models/invoice.rb

SELECT "line_items".* FROM "line_items" WHERE "line_items"."invoice_id" = 1 AND "line_items"."item_type" = 'item'
---
  def recalculate_totals!
    items = line_items.where(item_type: 'item')
    discounts = line_items.where(item_type: 'discount')

    calculated_subtotal = items.sum { |i| (i.quantity || 0) * (i.unit_price || 0) }